<?php
/**
 * Created by PhpStorm.
 * User: Alexandr Statut
 * Date: 01.12.2021
 * Time: 11:00
 */

use cfg\Settings,
    core\SC;

/*
+----------------------------------------------------------------------------------------------------
| Версия платформы ( устанавливается автором для контроля обновлений, не рекомендуется менять )
+----------------------------------------------------------------------------------------------------
*/
define('VERSION', 'SimpleCoding v.3.3.2');

/*
+----------------------------------------------------------------------------------------------------
| Корень сайта ( в файловой системе )
+----------------------------------------------------------------------------------------------------
*/
define('ROOT', __DIR__ . DIRECTORY_SEPARATOR);

/*
+----------------------------------------------------------------------------------------------------
| Тип файлов проекта ( в основном php )
+----------------------------------------------------------------------------------------------------
*/
define('EXT', '.php');

# местный автолоадер
if (file_exists(__DIR__ . DIRECTORY_SEPARATOR . 'autoloader.php')) {
    include_once __DIR__ . DIRECTORY_SEPARATOR . 'autoloader.php';
}

# автолоадэр вендорной папки
if (file_exists(__DIR__ . '/vendor/autoload.php')) {
    require_once __DIR__ . '/vendor/autoload.php';
}

# автолоадэр стартового экрана
if (file_exists(__DIR__ . '/install.php') && !\core\Route::adminFolder()) {
    require_once __DIR__ . '/install.php';
    die;
}

/*
+----------------------------------------------------------------------------------------------------
| Режим продакшн вкл / выкл
+----------------------------------------------------------------------------------------------------
*/
define('PROD', Settings::$production);

/*
+----------------------------------------------------------------------------------------------------
| Локально ли запущен сайт
+----------------------------------------------------------------------------------------------------
*/
define("LOCAL", (bool)(strpos(SC::getIp(), "127.0.0.") !== false || strpos(SC::getIp(), "192.168.0.") !== false));

/*
+----------------------------------------------------------------------------------------------------
| Глобальные функции
+----------------------------------------------------------------------------------------------------
*/
require_once ROOT . 'system' . DIRECTORY_SEPARATOR . 'global' . EXT;

/*
+----------------------------------------------------------------------------------------------------
| Инициализация
+----------------------------------------------------------------------------------------------------
*/
if (PROD) {
    try {
        require_once ROOT . 'system' . DIRECTORY_SEPARATOR . 'init' . EXT;
    } catch (Error $e) {
        SC::logSystemError($e, 'error');
    } catch (Exception $e) {
        SC::logSystemError($e, 'exception');
    } catch (Throwable $e) {
        SC::logSystemError($e, 'throw');
    }
} else {
    require_once ROOT . 'system' . DIRECTORY_SEPARATOR . 'init' . EXT;
}
